package bg.tu_varna.sit.task10;

/**
 * Програмата по-долу е разписана в помощ на управлението на финансовия портфейл на фирма.
 * Анализирайте решението и определите грешката (без да пренаписвате целия код),
 * така че паричните ѝ средства да бъдат вложени в краткосрочни депозити  (до 1 г.) за получаване на по-изгодна лихва.
 * (Депозит - влог, при който сумата не може да бъде изтеглена преди изтичането на срока му, награден с по-висока лихва.)
 * Съхранява се информация за валутата на финансовия актив (currency), вложената сума (quantity), годишен лихвен процент (interestRate),
 * продължителност на депозита в месеци (monthsOfDeposit). Когато депозитът е за период, по-малък от година, лихвата, която се получава,
 * е пропорционална на броя на месеците. Например ако депозитът е за 9 месеца, фирмата ще получи 9/12 от годишната лихва.
 * Програмата предвижда инструменти за изчисляване на начислената лихва по влогове и депозити.
 * Първата задача за анализ, която е направен опит да бъде решена, е каква лихва следва да се получи от направените депозити в USD.
 */

public class Application {
    public static void main(String[] args) {

        Deposit[] deposits = {new Deposit("USD", 10000, 3.0, 10),
                new Deposit("EUR", 2000, 4.7, 6),
                new Deposit("USD", 10000, 3.2, 6),
                new Deposit("BGN", 42000, 3.0, 10),
                new Deposit("USD", 30000, 5.1, 12),
                new Deposit("BGN", 22000, 3.3, 3),
                new Deposit("USD", 7200, 5.0, 3),
                new Deposit("BGN", 15600, 2.5, 5),
                new Deposit("BGN", 12000, 3.0, 9),
                new Deposit("BGN", 8000, 4.1, 3)};

        double interest = AccountingFirm.calculateInterest(deposits, "USD");

        System.out.printf("The interest in USD deposits is %.2f USD",interest);
    }
}
